#### Terraform Format and Style (EKS) 🖌`success`
#### Terraform Initialization (EKS) ⚙️`success`
#### Terraform Validation (EKS) 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan (EKS) 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.http.aws_load_balancer_controller_iam_policy: Reading...
data.http.aws_load_balancer_controller_iam_policy: Read complete after 1s [id=https://raw.githubusercontent.com/kubernetes-sigs/aws-load-balancer-controller/main/docs/install/iam_policy.json]
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # data.aws_iam_policy_document.karpenter_controller_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "karpenter_controller_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:karpenter:karpenter",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_cloudwatch_log_group.eks_cluster will be created
  + resource "aws_cloudwatch_log_group" "eks_cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/eks-poc/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "eks-poc"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "karpenter.sh/discovery" = "eks-poc"
        }
      + tags_all                  = {
          + "karpenter.sh/discovery" = "eks-poc"
        }
      + version                   = "1.28"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = "172.20.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.eks_ng_private will be created
  + resource "aws_eks_node_group" "eks_ng_private" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eks-poc"
      + disk_size              = 40
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "eks-ng-private"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = "1.28"

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_instance_profile.karpenter will be created
  + resource "aws_iam_instance_profile" "karpenter" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "KarpenterNodeInstanceProfile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "karpenter-instance-node-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_policy.aws_load_balancer_controller_policy will be created
  + resource "aws_iam_policy" "aws_load_balancer_controller_policy" {
      + arn         = (known after apply)
      + description = "AWS Load Balancer Controller IAM Policy"
      + id          = (known after apply)
      + name        = "aws-load-balancer-controller-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.karpenter_controller will be created
  + resource "aws_iam_policy" "karpenter_controller" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "KarpenterController"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "iam:PassRole",
                          + "ec2:RunInstances",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:CreateTags",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                          + "iam:GetInstanceProfile",
                          + "ec2:DescribeImages",
                          + "iam:CreateInstanceProfile",
                          + "iam:AddRoleToInstanceProfile",
                          + "iam:RemoveRoleFromInstanceProfile",
                          + "iam:DeleteInstanceProfile",
                          + "iam:TagInstanceProfile",
                          + "pricing:GetProducts",
                          + "ec2:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Karpenter"
                    },
                  + {
                      + Action    = "ec2:TerminateInstances"
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/Name" = "*karpenter*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ConditionalEC2Termination"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.aws_load_balancer_controller_role will be created
  + resource "aws_iam_role" "aws_load_balancer_controller_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-load-balancer-controller-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_nodegroup_role will be created
  + resource "aws_iam_role" "eks_nodegroup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-nodegroup-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.karpenter_controller will be created
  + resource "aws_iam_role" "karpenter_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "karpenter-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.karpenter_instance_node_role will be created
  + resource "aws_iam_role" "karpenter_instance_node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "karpenter-instance-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.amazon_eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.amazon_eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-nodegroup-role"
    }

  # aws_iam_role_policy_attachment.amazon_eks_worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-nodegroup-role"
    }

  # aws_iam_role_policy_attachment.aws_load_balancer_controller_attachment will be created
  + resource "aws_iam_role_policy_attachment" "aws_load_balancer_controller_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aws-load-balancer-controller-role"
    }

  # aws_iam_role_policy_attachment.eks_amazon_ec2_container_registry_readonly will be created
  + resource "aws_iam_role_policy_attachment" "eks_amazon_ec2_container_registry_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-nodegroup-role"
    }

  # aws_iam_role_policy_attachment.eks_amazon_ssm_managed_instance_core will be created
  + resource "aws_iam_role_policy_attachment" "eks_amazon_ssm_managed_instance_core" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-nodegroup-role"
    }

  # aws_iam_role_policy_attachment.karpenter_controller_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "karpenter_controller_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "karpenter-controller"
    }

  # aws_iam_role_policy_attachment.karpenter_instance_node_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "karpenter_instance_node_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "karpenter-instance-node-role"
    }

  # aws_iam_role_policy_attachment.karpenter_instance_node_ec2_container_registry_readonly will be created
  + resource "aws_iam_role_policy_attachment" "karpenter_instance_node_ec2_container_registry_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "karpenter-instance-node-role"
    }

  # aws_iam_role_policy_attachment.karpenter_instance_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "karpenter_instance_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "karpenter-instance-node-role"
    }

  # aws_iam_role_policy_attachment.karpenter_instance_node_ssm_managed_instance_core will be created
  + resource "aws_iam_role_policy_attachment" "karpenter_instance_node_ssm_managed_instance_core" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "karpenter-instance-node-role"
    }

  # aws_iam_user.admin_user will be created
  + resource "aws_iam_user" "admin_user" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "eksadmin1"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.admin_user will be created
  + resource "aws_iam_user_policy_attachment" "admin_user" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + user       = "eksadmin1"
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 3600
      + verify                     = false
      + version                    = "5.29.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "applicationSet.replicaCount"
          + value = "2"
        }
      + set {
          + name  = "controller.replicas"
          + value = "1"
        }
      + set {
          + name  = "redis-ha.enabled"
          + value = "true"
        }
      + set {
          + name  = "server.autoscaling.enabled"
          + value = "true"
        }
      + set {
          + name  = "server.autoscaling.minReplicas"
          + value = "2"
        }
      + set {
          + name  = "server.service.type"
          + value = "ClusterIP"
        }
    }

  # helm_release.karpenter will be created
  + resource "helm_release" "karpenter" {
      + atomic                     = false
      + chart                      = "karpenter"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "karpenter"
      + namespace                  = "karpenter"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.karpenter.sh"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 3000
      + values                     = [
          + <<-EOT
                # -- Overrides the chart's name.
                nameOverride: ""
                # -- Overrides the chart's computed fullname.
                fullnameOverride: ""
                # -- Additional labels to add into metadata.
                additionalLabels: {}
                # app: karpenter
                
                # -- Additional annotations to add into metadata.
                additionalAnnotations: {}
                # -- Image pull policy for Docker images.
                imagePullPolicy: IfNotPresent
                # -- Image pull secrets for Docker images.
                imagePullSecrets: []
                serviceAccount:
                  # -- Specifies if a ServiceAccount should be created.
                  create: true
                  # -- The name of the ServiceAccount to use.
                  # If not set and create is true, a name is generated using the fullname template.
                  name: ""
                  # -- Additional annotations for the ServiceAccount.
                  annotations: {}
                serviceMonitor:
                  # -- Specifies whether a ServiceMonitor should be created.
                  enabled: false
                  # -- Additional labels for the ServiceMonitor.
                  additionalLabels: {}
                  # -- Endpoint configuration for the ServiceMonitor.
                  endpointConfig: {}
                # -- Number of replicas.
                replicas: 2
                # -- The number of old ReplicaSets to retain to allow rollback.
                revisionHistoryLimit: 10
                # -- Strategy for updating the pod.
                strategy:
                  rollingUpdate:
                    maxUnavailable: 1
                # -- Additional labels for the pod.
                podLabels: {}
                # -- Additional annotations for the pod.
                podAnnotations: {}
                podDisruptionBudget:
                  name: karpenter
                  maxUnavailable: 1
                # -- SecurityContext for the pod.
                podSecurityContext:
                  fsGroup: 1000
                # -- PriorityClass name for the pod.
                priorityClassName: system-cluster-critical
                # -- Override the default termination grace period for the pod.
                terminationGracePeriodSeconds:
                # -- Bind the pod to the host network.
                # This is required when using a custom CNI.
                hostNetwork: false
                # -- Configure the DNS Policy for the pod
                dnsPolicy: Default
                # -- Configure DNS Config for the pod
                dnsConfig: {}
                #  options:
                #    - name: ndots
                #      value: "1"
                # -- Node selectors to schedule the pod to nodes with labels.
                nodeSelector:
                  kubernetes.io/os: linux
                # -- Affinity rules for scheduling the pod.
                affinity:
                  nodeAffinity:
                    requiredDuringSchedulingIgnoredDuringExecution:
                      nodeSelectorTerms:
                        - matchExpressions:
                            - key: karpenter.sh/provisioner-name
                              operator: DoesNotExist
                        - matchExpressions:
                          - key: eks.amazonaws.com/nodegroup
                            operator: In
                            values:
                            - eks-ng-private
                # -- topologySpreadConstraints to increase the controller resilience
                topologySpreadConstraints:
                  - maxSkew: 1
                    topologyKey: topology.kubernetes.io/zone
                    whenUnsatisfiable: ScheduleAnyway
                # -- Tolerations to allow the pod to be scheduled to nodes with taints.
                tolerations:
                  - key: CriticalAddonsOnly
                    operator: Exists
                # -- Additional volumes for the pod.
                extraVolumes: []
                # - name: aws-iam-token
                #   projected:
                #     defaultMode: 420
                #     sources:
                #     - serviceAccountToken:
                #         audience: sts.amazonaws.com
                #         expirationSeconds: 86400
                #         path: token
                
                controller:
                  # -- Controller image.
                  image: "public.ecr.aws/karpenter/controller:v0.16.3@sha256:68db4f092cf9cc83f5ef9e2fbc5407c2cb682e81f64dfaa700a7602ede38b1cf"
                  # -- SecurityContext for the controller container.
                  securityContext: {}
                  # -- Additional environment variables for the controller pod.
                  env: []
                  # - name: AWS_REGION
                  #   value: eu-west-1
                
                  # -- Resources for the controller pod.
                  resources:
                    requests:
                      cpu: 1
                      memory: 1Gi
                    limits:
                      cpu: 1
                      memory: 1Gi
                  # -- Controller log level, defaults to the global log level
                  logLevel: ""
                  # -- Controller log encoding, defaults to the global log encoding
                  logEncoding: ""
                  # -- Additional volumeMounts for the controller pod.
                  extraVolumeMounts: []
                  # - name: aws-iam-token
                  #   mountPath: /var/run/secrets/eks.amazonaws.com/serviceaccount
                  #   readOnly: true
                
                  # The maximum length of a batch window. The longer this is, the more pods we can consider for provisioning at one
                  # time which usually results in fewer but larger nodes.
                  batchMaxDuration: 10s
                  # The maximum amount of time with no new ending pods that if exceeded ends the current batching window. If pods arrive
                  # faster than this time, the batching window will be extended up to the maxDuration. If they arrive slower, the pods
                  # will be batched separately.
                  batchIdleDuration: 1s
                webhook:
                  # -- Webhook image.
                  image: "public.ecr.aws/karpenter/webhook:v0.16.3@sha256:96a2d9b06d6bc5127801f358f74b1cf2d289b423a2e9ba40c573c0b14b17dafa"
                  # -- SecurityContext for the webhook container.
                  securityContext: {}
                  # -- The container port to use for the webhook.
                  port: 8443
                  # -- Additional environment variables for the webhook pod.
                  env: []
                  # - name: AWS_REGION
                  #   value: eu-west-1
                
                  # -- Resources for the webhook pod.
                  resources:
                    requests:
                      cpu: 200m
                      memory: 100Mi
                    limits:
                      cpu: 200m
                      memory: 100Mi
                  # -- Webhook log level, defaults to the global log level
                  logLevel: ""
                  # -- Webhook log encoding, defaults to the global log encoding
                  logEncoding: ""
                  # -- Additional volumeMounts for the webhook pod.
                  extraVolumeMounts: []
                # -- Global log level
                logLevel: debug
                # -- Gloabl log encoding
                logEncoding: console
                # -- Cluster name.
                clusterName: ""
                # -- Cluster endpoint.
                clusterEndpoint: ""
                aws:
                  # -- The default instance profile to use when launching nodes on AWS
                  defaultInstanceProfile: ""
            EOT,
        ]
      + verify                     = false
      + version                    = "0.16.3"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "aws.defaultInstanceProfile"
          + value = "KarpenterNodeInstanceProfile"
        }
      + set {
          + name  = "clusterEndpoint"
          + value = (known after apply)
        }
      + set {
          + name  = "clusterName"
          + value = (known after apply)
        }
      + set {
          + name  = "replicas"
          + value = "1"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "karpenter"
        }
    }

  # helm_release.loadbalancer_controller will be created
  + resource "helm_release" "loadbalancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.6.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = (known after apply)
        }
      + set {
          + name  = "image.repository"
          + value = "602401143452.dkr.ecr.us-east-1.amazonaws.com/amazon/aws-load-balancer-controller"
        }
      + set {
          + name  = "region"
          + value = "us-east-1"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
        }
    }

  # helm_release.metrics_server_release will be created
  + resource "helm_release" "metrics_server_release" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "3.11.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.prometheus will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "prometheus"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 2000
      + values                     = [
          + <<-EOT
                rbac:
                  create: true
                
                podSecurityPolicy:
                  enabled: false
                
                imagePullSecrets: []
                # - name: "image-pull-secret"
                
                ## Define serviceAccount names for components. Defaults to component's fully qualified name.
                ##
                serviceAccounts:
                  server:
                    create: true
                    name: ""
                    annotations: {}
                
                ## Monitors ConfigMap changes and POSTs to a URL
                ## Ref: https://github.com/jimmidyson/configmap-reload
                ##
                configmapReload:
                  prometheus:
                    ## If false, the configmap-reload container will not be deployed
                    ##
                    enabled: true
                
                    ## configmap-reload container name
                    ##
                    name: configmap-reload
                
                    ## configmap-reload container image
                    ##
                    image:
                      repository: jimmidyson/configmap-reload
                      tag: v0.8.0
                      # When digest is set to a non-empty value, images will be pulled by digest (regardless of tag value).
                      digest: ""
                      pullPolicy: IfNotPresent
                
                    # containerPort: 9533
                
                    ## Additional configmap-reload container arguments
                    ##
                    extraArgs: {}
                    ## Additional configmap-reload volume directories
                    ##
                    extraVolumeDirs: []
                
                
                    ## Additional configmap-reload mounts
                    ##
                    extraConfigmapMounts: []
                      # - name: prometheus-alerts
                      #   mountPath: /etc/alerts.d
                      #   subPath: ""
                      #   configMap: prometheus-alerts
                      #   readOnly: true
                
                    ## Security context to be added to configmap-reload container
                    containerSecurityContext: {}
                
                    ## configmap-reload resource requests and limits
                    ## Ref: http://kubernetes.io/docs/user-guide/compute-resources/
                    ##
                    resources: {}
                
                server:
                  ## Prometheus server container name
                  ##
                  name: server
                
                  ## Use a ClusterRole (and ClusterRoleBinding)
                  ## - If set to false - we define a RoleBinding in the defined namespaces ONLY
                  ##
                  ## NB: because we need a Role with nonResourceURL's ("/metrics") - you must get someone with Cluster-admin privileges to define this role for you, before running with this setting enabled.
                  ##     This makes prometheus work - for users who do not have ClusterAdmin privs, but wants prometheus to operate on their own namespaces, instead of clusterwide.
                  ##
                  ## You MUST also set namespaces to the ones you have access to and want monitored by Prometheus.
                  ##
                  # useExistingClusterRoleName: nameofclusterrole
                
                  ## namespaces to monitor (instead of monitoring all - clusterwide). Needed if you want to run without Cluster-admin privileges.
                  # namespaces:
                  #   - yournamespace
                
                  # sidecarContainers - add more containers to prometheus server
                  # Key/Value where Key is the sidecar `- name: <Key>`
                  # Example:
                  #   sidecarContainers:
                  #      webserver:
                  #        image: nginx
                  sidecarContainers: {}
                
                  # sidecarTemplateValues - context to be used in template for sidecarContainers
                  # Example:
                  #   sidecarTemplateValues: *your-custom-globals
                  #   sidecarContainers:
                  #     webserver: |-
                  #       {{ include "webserver-container-template" . }}
                  # Template for `webserver-container-template` might looks like this:
                  #   image: "{{ .Values.server.sidecarTemplateValues.repository }}:{{ .Values.server.sidecarTemplateValues.tag }}"
                  #   ...
                  #
                  sidecarTemplateValues: {}
                
                  ## Prometheus server container image
                  ##
                  image:
                    repository: quay.io/prometheus/prometheus
                    # if not set appVersion field from Chart.yaml is used
                    tag: ""
                    # When digest is set to a non-empty value, images will be pulled by digest (regardless of tag value).
                    digest: ""
                    pullPolicy: IfNotPresent
                
                  ## prometheus server priorityClassName
                  ##
                  priorityClassName: ""
                
                  ## EnableServiceLinks indicates whether information about services should be injected
                  ## into pod's environment variables, matching the syntax of Docker links.
                  ## WARNING: the field is unsupported and will be skipped in K8s prior to v1.13.0.
                  ##
                  enableServiceLinks: true
                
                  ## The URL prefix at which the container can be accessed. Useful in the case the '-web.external-url' includes a slug
                  ## so that the various internal URLs are still able to access as they are in the default case.
                  ## (Optional)
                  prefixURL: ""
                
                  ## External URL which can access prometheus
                  ## Maybe same with Ingress host name
                  baseURL: ""
                
                  ## Additional server container environment variables
                  ##
                  ## You specify this manually like you would a raw deployment manifest.
                  ## This means you can bind in environment variables from secrets.
                  ##
                  ## e.g. static environment variable:
                  ##  - name: DEMO_GREETING
                  ##    value: "Hello from the environment"
                  ##
                  ## e.g. secret environment variable:
                  ## - name: USERNAME
                  ##   valueFrom:
                  ##     secretKeyRef:
                  ##       name: mysecret
                  ##       key: username
                  env: []
                
                  # List of flags to override default parameters, e.g:
                  # - --enable-feature=agent
                  # - --storage.agent.retention.max-time=30m
                  defaultFlagsOverride: []
                
                  extraFlags:
                    - web.enable-lifecycle
                    ## web.enable-admin-api flag controls access to the administrative HTTP API which includes functionality such as
                    ## deleting time series. This is disabled by default.
                    # - web.enable-admin-api
                    ##
                    ## storage.tsdb.no-lockfile flag controls BD locking
                    # - storage.tsdb.no-lockfile
                    ##
                    ## storage.tsdb.wal-compression flag enables compression of the write-ahead log (WAL)
                    # - storage.tsdb.wal-compression
                
                  ## Path to a configuration file on prometheus server container FS
                  configPath: /etc/config/prometheus.yml
                
                  ### The data directory used by prometheus to set --storage.tsdb.path
                  ### When empty server.persistentVolume.mountPath is used instead
                  storagePath: ""
                
                  global:
                    ## How frequently to scrape targets by default
                    ##
                    scrape_interval: 1m
                    ## How long until a scrape request times out
                    ##
                    scrape_timeout: 10s
                    ## How frequently to evaluate rules
                    ##
                    evaluation_interval: 1m
                  ## https://prometheus.io/docs/prometheus/latest/configuration/configuration/#remote_write
                  ##
                  remoteWrite: []
                  ## https://prometheus.io/docs/prometheus/latest/configuration/configuration/#remote_read
                  ##
                  remoteRead: []
                
                  ## Custom HTTP headers for Liveness/Readiness/Startup Probe
                  ##
                  ## Useful for providing HTTP Basic Auth to healthchecks
                  probeHeaders: []
                    # - name: "Authorization"
                    #   value: "Bearer ABCDEabcde12345"
                
                  ## Additional Prometheus server container arguments
                  ##
                  extraArgs: {}
                
                  ## Additional InitContainers to initialize the pod
                  ##
                  extraInitContainers: []
                
                  ## Additional Prometheus server Volume mounts
                  ##
                  extraVolumeMounts: []
                
                  ## Additional Prometheus server Volumes
                  ##
                  extraVolumes: []
                
                  ## Additional Prometheus server hostPath mounts
                  ##
                  extraHostPathMounts: []
                    # - name: certs-dir
                    #   mountPath: /etc/kubernetes/certs
                    #   subPath: ""
                    #   hostPath: /etc/kubernetes/certs
                    #   readOnly: true
                
                  extraConfigmapMounts: []
                    # - name: certs-configmap
                    #   mountPath: /prometheus
                    #   subPath: ""
                    #   configMap: certs-configmap
                    #   readOnly: true
                
                  ## Additional Prometheus server Secret mounts
                  # Defines additional mounts with secrets. Secrets must be manually created in the namespace.
                  extraSecretMounts: []
                    # - name: secret-files
                    #   mountPath: /etc/secrets
                    #   subPath: ""
                    #   secretName: prom-secret-files
                    #   readOnly: true
                
                  ## ConfigMap override where fullname is {{.Release.Name}}-{{.Values.server.configMapOverrideName}}
                  ## Defining configMapOverrideName will cause templates/server-configmap.yaml
                  ## to NOT generate a ConfigMap resource
                  ##
                  configMapOverrideName: ""
                
                  ## Extra labels for Prometheus server ConfigMap (ConfigMap that holds serverFiles)
                  extraConfigmapLabels: {}
                
                  ingress:
                    ## If true, Prometheus server Ingress will be created
                    ##
                    enabled: false
                
                    # For Kubernetes >= 1.18 you should specify the ingress-controller via the field ingressClassName
                    # See https://kubernetes.io/blog/2020/04/02/improvements-to-the-ingress-api-in-kubernetes-1.18/#specifying-the-class-of-an-ingress
                    # ingressClassName: nginx
                
                    ## Prometheus server Ingress annotations
                    ##
                    annotations: {}
                    #   kubernetes.io/ingress.class: nginx
                    #   kubernetes.io/tls-acme: 'true'
                
                    ## Prometheus server Ingress additional labels
                    ##
                    extraLabels: {}
                
                    ## Prometheus server Ingress hostnames with optional path
                    ## Must be provided if Ingress is enabled
                    ##
                    hosts: []
                    #   - prometheus.domain.com
                    #   - domain.com/prometheus
                
                    path: /
                
                    # pathType is only for k8s >= 1.18
                    pathType: Prefix
                
                    ## Extra paths to prepend to every host configuration. This is useful when working with annotation based services.
                    extraPaths: []
                    # - path: /*
                    #   backend:
                    #     serviceName: ssl-redirect
                    #     servicePort: use-annotation
                
                    ## Prometheus server Ingress TLS configuration
                    ## Secrets must be manually created in the namespace
                    ##
                    tls: []
                    #   - secretName: prometheus-server-tls
                    #     hosts:
                    #       - prometheus.domain.com
                
                  ## Server Deployment Strategy type
                  strategy:
                    type: Recreate
                
                  ## hostAliases allows adding entries to /etc/hosts inside the containers
                  hostAliases: []
                  #   - ip: "127.0.0.1"
                  #     hostnames:
                  #       - "example.com"
                
                  ## Node tolerations for server scheduling to nodes with taints
                  ## Ref: https://kubernetes.io/docs/concepts/configuration/assign-pod-node/
                  ##
                  tolerations: []
                    # - key: "key"
                    #   operator: "Equal|Exists"
                    #   value: "value"
                    #   effect: "NoSchedule|PreferNoSchedule|NoExecute(1.6 only)"
                
                  ## Node labels for Prometheus server pod assignment
                  ## Ref: https://kubernetes.io/docs/user-guide/node-selection/
                  ##
                  nodeSelector: {}
                
                  ## Pod affinity
                  ##
                  affinity: {}
                
                  ## PodDisruptionBudget settings
                  ## ref: https://kubernetes.io/docs/concepts/workloads/pods/disruptions/
                  ##
                  podDisruptionBudget:
                    enabled: false
                    maxUnavailable: 1
                
                  ## Use an alternate scheduler, e.g. "stork".
                  ## ref: https://kubernetes.io/docs/tasks/administer-cluster/configure-multiple-schedulers/
                  ##
                  # schedulerName:
                
                  persistentVolume:
                    ## If true, Prometheus server will create/use a Persistent Volume Claim
                    ## If false, use emptyDir
                    ##
                    enabled: true
                
                    ## Prometheus server data Persistent Volume access modes
                    ## Must match those of existing PV or dynamic provisioner
                    ## Ref: http://kubernetes.io/docs/user-guide/persistent-volumes/
                    ##
                    accessModes:
                      - ReadWriteOnce
                
                    ## Prometheus server data Persistent Volume labels
                    ##
                    labels: {}
                
                    ## Prometheus server data Persistent Volume annotations
                    ##
                    annotations: {}
                
                    ## Prometheus server data Persistent Volume existing claim name
                    ## Requires server.persistentVolume.enabled: true
                    ## If defined, PVC must be created manually before volume will be bound
                    existingClaim: ""
                
                    ## Prometheus server data Persistent Volume mount root path
                    ##
                    mountPath: /data
                
                    ## Prometheus server data Persistent Volume size
                    ##
                    size: 8Gi
                
                    ## Prometheus server data Persistent Volume Storage Class
                    ## If defined, storageClassName: <storageClass>
                    ## If set to "-", storageClassName: "", which disables dynamic provisioning
                    ## If undefined (the default) or set to null, no storageClassName spec is
                    ##   set, choosing the default provisioner.  (gp2 on AWS, standard on
                    ##   GKE, AWS & OpenStack)
                    ##
                    # storageClass: "-"
                
                    ## Prometheus server data Persistent Volume Binding Mode
                    ## If defined, volumeBindingMode: <volumeBindingMode>
                    ## If undefined (the default) or set to null, no volumeBindingMode spec is
                    ##   set, choosing the default mode.
                    ##
                    # volumeBindingMode: ""
                
                    ## Subdirectory of Prometheus server data Persistent Volume to mount
                    ## Useful if the volume's root directory is not empty
                    ##
                    subPath: ""
                
                    ## Persistent Volume Claim Selector
                    ## Useful if Persistent Volumes have been provisioned in advance
                    ## Ref: https://kubernetes.io/docs/concepts/storage/persistent-volumes/#selector
                    ##
                    # selector:
                    #  matchLabels:
                    #    release: "stable"
                    #  matchExpressions:
                    #    - { key: environment, operator: In, values: [ dev ] }
                
                    ## Persistent Volume Name
                    ## Useful if Persistent Volumes have been provisioned in advance and you want to use a specific one
                    ##
                    # volumeName: ""
                
                  emptyDir:
                    ## Prometheus server emptyDir volume size limit
                    ##
                    sizeLimit: ""
                
                  ## Annotations to be added to Prometheus server pods
                  ##
                  podAnnotations: {}
                    # iam.amazonaws.com/role: prometheus
                
                  ## Labels to be added to Prometheus server pods
                  ##
                  podLabels: {}
                
                  ## Prometheus AlertManager configuration
                  ##
                  alertmanagers: []
                
                  ## Specify if a Pod Security Policy for node-exporter must be created
                  ## Ref: https://kubernetes.io/docs/concepts/policy/pod-security-policy/
                  ##
                  podSecurityPolicy:
                    annotations: {}
                      ## Specify pod annotations
                      ## Ref: https://kubernetes.io/docs/concepts/policy/pod-security-policy/#apparmor
                      ## Ref: https://kubernetes.io/docs/concepts/policy/pod-security-policy/#seccomp
                      ## Ref: https://kubernetes.io/docs/concepts/policy/pod-security-policy/#sysctl
                      ##
                      # seccomp.security.alpha.kubernetes.io/allowedProfileNames: '*'
                      # seccomp.security.alpha.kubernetes.io/defaultProfileName: 'docker/default'
                      # apparmor.security.beta.kubernetes.io/defaultProfileName: 'runtime/default'
                
                  ## Use a StatefulSet if replicaCount needs to be greater than 1 (see below)
                  ##
                  replicaCount: 1
                
                  ## Annotations to be added to deployment
                  ##
                  deploymentAnnotations: {}
                
                  statefulSet:
                    ## If true, use a statefulset instead of a deployment for pod management.
                    ## This allows to scale replicas to more than 1 pod
                    ##
                    enabled: false
                
                    annotations: {}
                    labels: {}
                    podManagementPolicy: OrderedReady
                
                    ## Alertmanager headless service to use for the statefulset
                    ##
                    headless:
                      annotations: {}
                      labels: {}
                      servicePort: 80
                      ## Enable gRPC port on service to allow auto discovery with thanos-querier
                      gRPC:
                        enabled: false
                        servicePort: 10901
                        # nodePort: 10901
                
                  ## Prometheus server readiness and liveness probe initial delay and timeout
                  ## Ref: https://kubernetes.io/docs/tasks/configure-pod-container/configure-liveness-readiness-startup-probes/
                  ##
                  tcpSocketProbeEnabled: false
                  probeScheme: HTTP
                  readinessProbeInitialDelay: 30
                  readinessProbePeriodSeconds: 5
                  readinessProbeTimeout: 4
                  readinessProbeFailureThreshold: 3
                  readinessProbeSuccessThreshold: 1
                  livenessProbeInitialDelay: 30
                  livenessProbePeriodSeconds: 15
                  livenessProbeTimeout: 10
                  livenessProbeFailureThreshold: 3
                  livenessProbeSuccessThreshold: 1
                  startupProbe:
                    enabled: false
                    periodSeconds: 5
                    failureThreshold: 30
                    timeoutSeconds: 10
                
                  ## Prometheus server resource requests and limits
                  ## Ref: http://kubernetes.io/docs/user-guide/compute-resources/
                  ##
                  resources: {}
                    # limits:
                    #   cpu: 500m
                    #   memory: 512Mi
                    # requests:
                    #   cpu: 500m
                    #   memory: 512Mi
                
                  # Required for use in managed kubernetes clusters (such as AWS EKS) with custom CNI (such as calico),
                  # because control-plane managed by AWS cannot communicate with pods' IP CIDR and admission webhooks are not working
                  ##
                  hostNetwork: false
                
                  # When hostNetwork is enabled, this will set to ClusterFirstWithHostNet automatically
                  dnsPolicy: ClusterFirst
                
                  # Use hostPort
                  # hostPort: 9090
                
                  ## Vertical Pod Autoscaler config
                  ## Ref: https://github.com/kubernetes/autoscaler/tree/master/vertical-pod-autoscaler
                  verticalAutoscaler:
                    ## If true a VPA object will be created for the controller (either StatefulSet or Deployemnt, based on above configs)
                    enabled: false
                    # updateMode: "Auto"
                    # containerPolicies:
                    # - containerName: 'prometheus-server'
                
                  # Custom DNS configuration to be added to prometheus server pods
                  dnsConfig: {}
                    # nameservers:
                    #   - 1.2.3.4
                    # searches:
                    #   - ns1.svc.cluster-domain.example
                    #   - my.dns.search.suffix
                    # options:
                    #   - name: ndots
                    #     value: "2"
                  #   - name: edns0
                
                  ## Security context to be added to server pods
                  ##
                  securityContext:
                    runAsUser: 65534
                    runAsNonRoot: true
                    runAsGroup: 65534
                    fsGroup: 65534
                
                  ## Security context to be added to server container
                  ##
                  containerSecurityContext: {}
                
                  service:
                    ## If false, no Service will be created for the Prometheus server
                    ##
                    enabled: true
                
                    annotations: {}
                    labels: {}
                    clusterIP: ""
                
                    ## List of IP addresses at which the Prometheus server service is available
                    ## Ref: https://kubernetes.io/docs/user-guide/services/#external-ips
                    ##
                    externalIPs: []
                
                    loadBalancerIP: ""
                    loadBalancerSourceRanges: []
                    servicePort: 80
                    sessionAffinity: None
                    type: ClusterIP
                
                    ## Enable gRPC port on service to allow auto discovery with thanos-querier
                    gRPC:
                      enabled: false
                      servicePort: 10901
                      # nodePort: 10901
                
                    ## If using a statefulSet (statefulSet.enabled=true), configure the
                    ## service to connect to a specific replica to have a consistent view
                    ## of the data.
                    statefulsetReplica:
                      enabled: false
                      replica: 0
                
                  ## Prometheus server pod termination grace period
                  ##
                  terminationGracePeriodSeconds: 300
                
                  ## Prometheus data retention period (default if not specified is 15 days)
                  ##
                  retention: "15d"
                
                ## Prometheus server ConfigMap entries for rule files (allow prometheus labels interpolation)
                ruleFiles: {}
                
                ## Prometheus server ConfigMap entries
                ##
                serverFiles:
                  ## Alerts configuration
                  ## Ref: https://prometheus.io/docs/prometheus/latest/configuration/alerting_rules/
                  alerting_rules.yml: {}
                  # groups:
                  #   - name: Instances
                  #     rules:
                  #       - alert: InstanceDown
                  #         expr: up == 0
                  #         for: 5m
                  #         labels:
                  #           severity: page
                  #         annotations:
                  #           description: '{{ $labels.instance }} of job {{ $labels.job }} has been down for more than 5 minutes.'
                  #           summary: 'Instance {{ $labels.instance }} down'
                  ## DEPRECATED DEFAULT VALUE, unless explicitly naming your files, please use alerting_rules.yml
                  alerts: {}
                
                  ## Records configuration
                  ## Ref: https://prometheus.io/docs/prometheus/latest/configuration/recording_rules/
                  recording_rules.yml: {}
                  ## DEPRECATED DEFAULT VALUE, unless explicitly naming your files, please use recording_rules.yml
                  rules: {}
                
                  prometheus.yml:
                    rule_files:
                      - /etc/config/recording_rules.yml
                      - /etc/config/alerting_rules.yml
                    ## Below two files are DEPRECATED will be removed from this default values file
                      - /etc/config/rules
                      - /etc/config/alerts
                
                    scrape_configs:
                      - job_name: prometheus
                        static_configs:
                          - targets:
                            - localhost:9090
                
                      # A scrape configuration for running Prometheus on a Kubernetes cluster.
                      # This uses separate scrape configs for cluster components (i.e. API server, node)
                      # and services to allow each to use different authentication configs.
                      #
                      # Kubernetes labels will be added as Prometheus labels on metrics via the
                      # `labelmap` relabeling action.
                
                      # Scrape config for API servers.
                      #
                      # Kubernetes exposes API servers as endpoints to the default/kubernetes
                      # service so this uses `endpoints` role and uses relabelling to only keep
                      # the endpoints associated with the default/kubernetes service using the
                      # default named port `https`. This works for single API server deployments as
                      # well as HA API server deployments.
                      - job_name: 'kubernetes-apiservers'
                
                        kubernetes_sd_configs:
                          - role: endpoints
                
                        # Default to scraping over https. If required, just disable this or change to
                        # `http`.
                        scheme: https
                
                        # This TLS & bearer token file config is used to connect to the actual scrape
                        # endpoints for cluster components. This is separate to discovery auth
                        # configuration because discovery & scraping are two separate concerns in
                        # Prometheus. The discovery auth config is automatic if Prometheus runs inside
                        # the cluster. Otherwise, more config options have to be provided within the
                        # <kubernetes_sd_config>.
                        tls_config:
                          ca_file: /var/run/secrets/kubernetes.io/serviceaccount/ca.crt
                          # If your node certificates are self-signed or use a different CA to the
                          # master CA, then disable certificate verification below. Note that
                          # certificate verification is an integral part of a secure infrastructure
                          # so this should only be disabled in a controlled environment. You can
                          # disable certificate verification by uncommenting the line below.
                          #
                          insecure_skip_verify: true
                        bearer_token_file: /var/run/secrets/kubernetes.io/serviceaccount/token
                
                        # Keep only the default/kubernetes service endpoints for the https port. This
                        # will add targets for each API server which Kubernetes adds an endpoint to
                        # the default/kubernetes service.
                        relabel_configs:
                          - source_labels: [__meta_kubernetes_namespace, __meta_kubernetes_service_name, __meta_kubernetes_endpoint_port_name]
                            action: keep
                            regex: default;kubernetes;https
                
                      - job_name: 'kubernetes-nodes'
                
                        # Default to scraping over https. If required, just disable this or change to
                        # `http`.
                        scheme: https
                
                        # This TLS & bearer token file config is used to connect to the actual scrape
                        # endpoints for cluster components. This is separate to discovery auth
                        # configuration because discovery & scraping are two separate concerns in
                        # Prometheus. The discovery auth config is automatic if Prometheus runs inside
                        # the cluster. Otherwise, more config options have to be provided within the
                        # <kubernetes_sd_config>.
                        tls_config:
                          ca_file: /var/run/secrets/kubernetes.io/serviceaccount/ca.crt
                          # If your node certificates are self-signed or use a different CA to the
                          # master CA, then disable certificate verification below. Note that
                          # certificate verification is an integral part of a secure infrastructure
                          # so this should only be disabled in a controlled environment. You can
                          # disable certificate verification by uncommenting the line below.
                          #
                          insecure_skip_verify: true
                        bearer_token_file: /var/run/secrets/kubernetes.io/serviceaccount/token
                
                        kubernetes_sd_configs:
                          - role: node
                
                        relabel_configs:
                          - action: labelmap
                            regex: __meta_kubernetes_node_label_(.+)
                          - target_label: __address__
                            replacement: kubernetes.default.svc:443
                          - source_labels: [__meta_kubernetes_node_name]
                            regex: (.+)
                            target_label: __metrics_path__
                            replacement: /api/v1/nodes/$1/proxy/metrics
                
                
                      - job_name: 'kubernetes-nodes-cadvisor'
                
                        # Default to scraping over https. If required, just disable this or change to
                        # `http`.
                        scheme: https
                
                        # This TLS & bearer token file config is used to connect to the actual scrape
                        # endpoints for cluster components. This is separate to discovery auth
                        # configuration because discovery & scraping are two separate concerns in
                        # Prometheus. The discovery auth config is automatic if Prometheus runs inside
                        # the cluster. Otherwise, more config options have to be provided within the
                        # <kubernetes_sd_config>.
                        tls_config:
                          ca_file: /var/run/secrets/kubernetes.io/serviceaccount/ca.crt
                          # If your node certificates are self-signed or use a different CA to the
                          # master CA, then disable certificate verification below. Note that
                          # certificate verification is an integral part of a secure infrastructure
                          # so this should only be disabled in a controlled environment. You can
                          # disable certificate verification by uncommenting the line below.
                          #
                          insecure_skip_verify: true
                        bearer_token_file: /var/run/secrets/kubernetes.io/serviceaccount/token
                
                        kubernetes_sd_configs:
                          - role: node
                
                        # This configuration will work only on kubelet 1.7.3+
                        # As the scrape endpoints for cAdvisor have changed
                        # if you are using older version you need to change the replacement to
                        # replacement: /api/v1/nodes/$1:4194/proxy/metrics
                        # more info here https://github.com/coreos/prometheus-operator/issues/633
                        relabel_configs:
                          - action: labelmap
                            regex: __meta_kubernetes_node_label_(.+)
                          - target_label: __address__
                            replacement: kubernetes.default.svc:443
                          - source_labels: [__meta_kubernetes_node_name]
                            regex: (.+)
                            target_label: __metrics_path__
                            replacement: /api/v1/nodes/$1/proxy/metrics/cadvisor
                
                        # Metric relabel configs to apply to samples before ingestion.
                        # [Metric Relabeling](https://prometheus.io/docs/prometheus/latest/configuration/configuration/#metric_relabel_configs)
                        # metric_relabel_configs:
                        # - action: labeldrop
                        #   regex: (kubernetes_io_hostname|failure_domain_beta_kubernetes_io_region|beta_kubernetes_io_os|beta_kubernetes_io_arch|beta_kubernetes_io_instance_type|failure_domain_beta_kubernetes_io_zone)
                
                      # Scrape config for service endpoints.
                      #
                      # The relabeling allows the actual service scrape endpoint to be configured
                      # via the following annotations:
                      #
                      # * `prometheus.io/scrape`: Only scrape services that have a value of
                      # `true`, except if `prometheus.io/scrape-slow` is set to `true` as well.
                      # * `prometheus.io/scheme`: If the metrics endpoint is secured then you will need
                      # to set this to `https` & most likely set the `tls_config` of the scrape config.
                      # * `prometheus.io/path`: If the metrics path is not `/metrics` override this.
                      # * `prometheus.io/port`: If the metrics are exposed on a different port to the
                      # service then set this appropriately.
                      # * `prometheus.io/param_<parameter>`: If the metrics endpoint uses parameters
                      # then you can set any parameter
                      - job_name: 'kubernetes-service-endpoints'
                        honor_labels: true
                
                        kubernetes_sd_configs:
                          - role: endpoints
                
                        relabel_configs:
                          - source_labels: [__meta_kubernetes_service_annotation_prometheus_io_scrape]
                            action: keep
                            regex: true
                          - source_labels: [__meta_kubernetes_service_annotation_prometheus_io_scrape_slow]
                            action: drop
                            regex: true
                          - source_labels: [__meta_kubernetes_service_annotation_prometheus_io_scheme]
                            action: replace
                            target_label: __scheme__
                            regex: (https?)
                          - source_labels: [__meta_kubernetes_service_annotation_prometheus_io_path]
                            action: replace
                            target_label: __metrics_path__
                            regex: (.+)
                          - source_labels: [__address__, __meta_kubernetes_service_annotation_prometheus_io_port]
                            action: replace
                            target_label: __address__
                            regex: (.+?)(?::\d+)?;(\d+)
                            replacement: $1:$2
                          - action: labelmap
                            regex: __meta_kubernetes_service_annotation_prometheus_io_param_(.+)
                            replacement: __param_$1
                          - action: labelmap
                            regex: __meta_kubernetes_service_label_(.+)
                          - source_labels: [__meta_kubernetes_namespace]
                            action: replace
                            target_label: namespace
                          - source_labels: [__meta_kubernetes_service_name]
                            action: replace
                            target_label: service
                          - source_labels: [__meta_kubernetes_pod_node_name]
                            action: replace
                            target_label: node
                
                      # Scrape config for slow service endpoints; same as above, but with a larger
                      # timeout and a larger interval
                      #
                      # The relabeling allows the actual service scrape endpoint to be configured
                      # via the following annotations:
                      #
                      # * `prometheus.io/scrape-slow`: Only scrape services that have a value of `true`
                      # * `prometheus.io/scheme`: If the metrics endpoint is secured then you will need
                      # to set this to `https` & most likely set the `tls_config` of the scrape config.
                      # * `prometheus.io/path`: If the metrics path is not `/metrics` override this.
                      # * `prometheus.io/port`: If the metrics are exposed on a different port to the
                      # service then set this appropriately.
                      # * `prometheus.io/param_<parameter>`: If the metrics endpoint uses parameters
                      # then you can set any parameter
                      - job_name: 'kubernetes-service-endpoints-slow'
                        honor_labels: true
                
                        scrape_interval: 5m
                        scrape_timeout: 30s
                
                        kubernetes_sd_configs:
                          - role: endpoints
                
                        relabel_configs:
                          - source_labels: [__meta_kubernetes_service_annotation_prometheus_io_scrape_slow]
                            action: keep
                            regex: true
                          - source_labels: [__meta_kubernetes_service_annotation_prometheus_io_scheme]
                            action: replace
                            target_label: __scheme__
                            regex: (https?)
                          - source_labels: [__meta_kubernetes_service_annotation_prometheus_io_path]
                            action: replace
                            target_label: __metrics_path__
                            regex: (.+)
                          - source_labels: [__address__, __meta_kubernetes_service_annotation_prometheus_io_port]
                            action: replace
                            target_label: __address__
                            regex: (.+?)(?::\d+)?;(\d+)
                            replacement: $1:$2
                          - action: labelmap
                            regex: __meta_kubernetes_service_annotation_prometheus_io_param_(.+)
                            replacement: __param_$1
                          - action: labelmap
                            regex: __meta_kubernetes_service_label_(.+)
                          - source_labels: [__meta_kubernetes_namespace]
                            action: replace
                            target_label: namespace
                          - source_labels: [__meta_kubernetes_service_name]
                            action: replace
                            target_label: service
                          - source_labels: [__meta_kubernetes_pod_node_name]
                            action: replace
                            target_label: node
                
                      - job_name: 'prometheus-pushgateway'
                        honor_labels: true
                
                        kubernetes_sd_configs:
                          - role: service
                
                        relabel_configs:
                          - source_labels: [__meta_kubernetes_service_annotation_prometheus_io_probe]
                            action: keep
                            regex: pushgateway
                
                      # Example scrape config for probing services via the Blackbox Exporter.
                      #
                      # The relabeling allows the actual service scrape endpoint to be configured
                      # via the following annotations:
                      #
                      # * `prometheus.io/probe`: Only probe services that have a value of `true`
                      - job_name: 'kubernetes-services'
                        honor_labels: true
                
                        metrics_path: /probe
                        params:
                          module: [http_2xx]
                
                        kubernetes_sd_configs:
                          - role: service
                
                        relabel_configs:
                          - source_labels: [__meta_kubernetes_service_annotation_prometheus_io_probe]
                            action: keep
                            regex: true
                          - source_labels: [__address__]
                            target_label: __param_target
                          - target_label: __address__
                            replacement: blackbox
                          - source_labels: [__param_target]
                            target_label: instance
                          - action: labelmap
                            regex: __meta_kubernetes_service_label_(.+)
                          - source_labels: [__meta_kubernetes_namespace]
                            target_label: namespace
                          - source_labels: [__meta_kubernetes_service_name]
                            target_label: service
                
                      # Example scrape config for pods
                      #
                      # The relabeling allows the actual pod scrape endpoint to be configured via the
                      # following annotations:
                      #
                      # * `prometheus.io/scrape`: Only scrape pods that have a value of `true`,
                      # except if `prometheus.io/scrape-slow` is set to `true` as well.
                      # * `prometheus.io/scheme`: If the metrics endpoint is secured then you will need
                      # to set this to `https` & most likely set the `tls_config` of the scrape config.
                      # * `prometheus.io/path`: If the metrics path is not `/metrics` override this.
                      # * `prometheus.io/port`: Scrape the pod on the indicated port instead of the default of `9102`.
                      - job_name: 'kubernetes-pods'
                        honor_labels: true
                
                        kubernetes_sd_configs:
                          - role: pod
                
                        relabel_configs:
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_scrape]
                            action: keep
                            regex: true
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_scrape_slow]
                            action: drop
                            regex: true
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_scheme]
                            action: replace
                            regex: (https?)
                            target_label: __scheme__
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_path]
                            action: replace
                            target_label: __metrics_path__
                            regex: (.+)
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_port, __meta_kubernetes_pod_ip]
                            action: replace
                            regex: (\d+);(([A-Fa-f0-9]{1,4}::?){1,7}[A-Fa-f0-9]{1,4})
                            replacement: '[$2]:$1'
                            target_label: __address__
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_port, __meta_kubernetes_pod_ip]
                            action: replace
                            regex: (\d+);((([0-9]+?)(\.|$)){4})
                            replacement: $2:$1
                            target_label: __address__
                          - action: labelmap
                            regex: __meta_kubernetes_pod_annotation_prometheus_io_param_(.+)
                            replacement: __param_$1
                          - action: labelmap
                            regex: __meta_kubernetes_pod_label_(.+)
                          - source_labels: [__meta_kubernetes_namespace]
                            action: replace
                            target_label: namespace
                          - source_labels: [__meta_kubernetes_pod_name]
                            action: replace
                            target_label: pod
                          - source_labels: [__meta_kubernetes_pod_phase]
                            regex: Pending|Succeeded|Failed|Completed
                            action: drop
                
                      # Example Scrape config for pods which should be scraped slower. An useful example
                      # would be stackriver-exporter which queries an API on every scrape of the pod
                      #
                      # The relabeling allows the actual pod scrape endpoint to be configured via the
                      # following annotations:
                      #
                      # * `prometheus.io/scrape-slow`: Only scrape pods that have a value of `true`
                      # * `prometheus.io/scheme`: If the metrics endpoint is secured then you will need
                      # to set this to `https` & most likely set the `tls_config` of the scrape config.
                      # * `prometheus.io/path`: If the metrics path is not `/metrics` override this.
                      # * `prometheus.io/port`: Scrape the pod on the indicated port instead of the default of `9102`.
                      - job_name: 'kubernetes-pods-slow'
                        honor_labels: true
                
                        scrape_interval: 5m
                        scrape_timeout: 30s
                
                        kubernetes_sd_configs:
                          - role: pod
                
                        relabel_configs:
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_scrape_slow]
                            action: keep
                            regex: true
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_scheme]
                            action: replace
                            regex: (https?)
                            target_label: __scheme__
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_path]
                            action: replace
                            target_label: __metrics_path__
                            regex: (.+)
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_port, __meta_kubernetes_pod_ip]
                            action: replace
                            regex: (\d+);(([A-Fa-f0-9]{1,4}::?){1,7}[A-Fa-f0-9]{1,4})
                            replacement: '[$2]:$1'
                            target_label: __address__
                          - source_labels: [__meta_kubernetes_pod_annotation_prometheus_io_port, __meta_kubernetes_pod_ip]
                            action: replace
                            regex: (\d+);((([0-9]+?)(\.|$)){4})
                            replacement: $2:$1
                            target_label: __address__
                          - action: labelmap
                            regex: __meta_kubernetes_pod_annotation_prometheus_io_param_(.+)
                            replacement: __param_$1
                          - action: labelmap
                            regex: __meta_kubernetes_pod_label_(.+)
                          - source_labels: [__meta_kubernetes_namespace]
                            action: replace
                            target_label: namespace
                          - source_labels: [__meta_kubernetes_pod_name]
                            action: replace
                            target_label: pod
                          - source_labels: [__meta_kubernetes_pod_phase]
                            regex: Pending|Succeeded|Failed|Completed
                            action: drop
                
                # adds additional scrape configs to prometheus.yml
                # must be a string so you have to add a | after extraScrapeConfigs:
                # example adds prometheus-blackbox-exporter scrape config
                extraScrapeConfigs: ""
                  # - job_name: 'prometheus-blackbox-exporter'
                  #   metrics_path: /probe
                  #   params:
                  #     module: [http_2xx]
                  #   static_configs:
                  #     - targets:
                  #       - https://example.com
                  #   relabel_configs:
                  #     - source_labels: [__address__]
                  #       target_label: __param_target
                  #     - source_labels: [__param_target]
                  #       target_label: instance
                  #     - target_label: __address__
                  #       replacement: prometheus-blackbox-exporter:9115
                
                # Adds option to add alert_relabel_configs to avoid duplicate alerts in alertmanager
                # useful in H/A prometheus with different external labels but the same alerts
                alertRelabelConfigs: {}
                  # alert_relabel_configs:
                  # - source_labels: [dc]
                  #   regex: (.+)\d+
                  #   target_label: dc
                
                networkPolicy:
                  ## Enable creation of NetworkPolicy resources.
                  ##
                  enabled: false
                
                # Force namespace of namespaced resources
                forceNamespace: ""
                
                # Extra manifests to deploy as an array
                extraManifests: []
                  # - apiVersion: v1
                  #   kind: ConfigMap
                  #   metadata:
                  #   labels:
                  #     name: prometheus-extra
                  #   data:
                  #     extra-data: "value"
                
                # Configuration of subcharts defined in Chart.yaml
                
                ## alertmanager sub-chart configurable values
                ## Please see https://github.com/prometheus-community/helm-charts/tree/main/charts/alertmanager
                ##
                alertmanager:
                  ## If false, alertmanager will not be installed
                  ##
                  enabled: true
                
                  persistence:
                    size: 2Gi
                
                  podSecurityContext:
                    runAsUser: 65534
                    runAsNonRoot: true
                    runAsGroup: 65534
                    fsGroup: 65534
                
                ## kube-state-metrics sub-chart configurable values
                ## Please see https://github.com/prometheus-community/helm-charts/tree/main/charts/kube-state-metrics
                ##
                kube-state-metrics:
                  ## If false, kube-state-metrics sub-chart will not be installed
                  ##
                  enabled: true
                
                ## promtheus-node-exporter sub-chart configurable values
                ## Please see https://github.com/prometheus-community/helm-charts/tree/main/charts/prometheus-node-exporter
                ##
                prometheus-node-exporter:
                  ## If false, node-exporter will not be installed
                  ##
                  enabled: true
                
                  rbac:
                    pspEnabled: false
                
                  containerSecurityContext:
                    allowPrivilegeEscalation: false
                
                ## pprometheus-pushgateway sub-chart configurable values
                ## Please see https://github.com/prometheus-community/helm-charts/tree/main/charts/prometheus-pushgateway
                ##
                prometheus-pushgateway:
                  ## If false, pushgateway will not be installed
                  ##
                  enabled: true
                
                  # Optional service annotations
                  serviceAnnotations:
                    prometheus.io/probe: pushgateway
            EOT,
        ]
      + verify                     = false
      + version                    = "51.3.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "podSecurityPolicy.enabled"
          + value = "true"
        }
      + set {
          + name  = "server.persistentVolume.enabled"
          + value = "false"
        }
      + set {
          + name  = "server\\.resources"
          + value = <<-EOT
                "limits":
                  "cpu": "200m"
                  "memory": "50Mi"
                "requests":
                  "cpu": "100m"
                  "memory": "30Mi"
            EOT
        }
    }

  # kubectl_manifest.karpenter_node_template will be created
  + resource "kubectl_manifest" "karpenter_node_template" {
      + api_version             = "karpenter.k8s.aws/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "AWSNodeTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "my-provider"
      + namespace               = "karpenter"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1alpha1
            kind: AWSNodeTemplate
            metadata:
              name: my-provider
              namespace: karpenter
            spec:
              securityGroupSelector:
                kubernetes.io/cluster/eks-poc: owned
              subnetSelector:
                karpenter.sh/discovery: eks-poc
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter_provisioner will be created
  + resource "kubectl_manifest" "karpenter_provisioner" {
      + api_version             = "karpenter.sh/v1alpha5"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Provisioner"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = "karpenter"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1alpha5
            kind: Provisioner
            metadata:
              name: default
              namespace: karpenter
            spec:
              limits:
                resources:
                  cpu: 100
              providerRef:
                name: my-provider
              requirements:
              - key: karpenter.k8s.aws/instance-family
                operator: In
                values:
                - c5
                - m5
                - r5
                - t3
              ttlSecondsAfterEmpty: 60
              ttlSecondsUntilExpired: 604800
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.prometheus will be created
  + resource "kubectl_manifest" "prometheus" {
      + api_version             = "networking.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Ingress"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "grafana"
      + namespace               = "prometheus"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: Ingress
            metadata:
              annotations:
                alb.ingress.kubernetes.io/load-balancer-name: prometheus-ingress
                alb.ingress.kubernetes.io/scheme: internet-facing
                alb.ingress.kubernetes.io/target-type: ip
              name: grafana
              namespace: prometheus
            spec:
              ingressClassName: my-aws-ingress-class
              rules:
              - host: monitoring.devopsprotech.com
                http:
                  paths:
                  - backend:
                      service:
                        name: prometheus-grafana
                        port:
                          number: 80
                    path: /
                    pathType: Prefix
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_config_map_v1.aws_auth will be created
  + resource "kubernetes_config_map_v1" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_ingress_class_v1.ingress_class_default will be created
  + resource "kubernetes_ingress_class_v1" "ingress_class_default" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "my-aws-ingress-class"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + controller = "ingress.k8s.aws/alb"
        }
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"        = "eks-vpc-dev-default"
          + "environment" = "dev"
        }
      + tags_all               = {
          + "Name"        = "eks-vpc-dev-default"
          + "environment" = "dev"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"        = "eks-vpc-dev-default"
          + "environment" = "dev"
        }
      + tags_all               = {
          + "Name"        = "eks-vpc-dev-default"
          + "environment" = "dev"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "eks-vpc-dev-default"
          + "environment" = "dev"
        }
      + tags_all               = {
          + "Name"        = "eks-vpc-dev-default"
          + "environment" = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "eks-vpc-dev-us-east-1a"
          + "environment" = "dev"
        }
      + tags_all             = {
          + "Name"        = "eks-vpc-dev-us-east-1a"
          + "environment" = "dev"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "eks-vpc-dev"
          + "environment" = "dev"
        }
      + tags_all = {
          + "Name"        = "eks-vpc-dev"
          + "environment" = "dev"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"        = "eks-vpc-dev-us-east-1a"
          + "environment" = "dev"
        }
      + tags_all                           = {
          + "Name"        = "eks-vpc-dev-us-east-1a"
          + "environment" = "dev"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "eks-vpc-dev-private"
          + "environment" = "dev"
        }
      + tags_all         = {
          + "Name"        = "eks-vpc-dev-private"
          + "environment" = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "eks-vpc-dev-public"
          + "environment" = "dev"
        }
      + tags_all         = {
          + "Name"        = "eks-vpc-dev-public"
          + "environment" = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "eks-vpc-dev-private-us-east-1a"
          + "Type"                            = "private-subnet"
          + "environment"                     = "dev"
          + "karpenter.sh/discovery"          = "eks-poc"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                            = "eks-vpc-dev-private-us-east-1a"
          + "Type"                            = "private-subnet"
          + "environment"                     = "dev"
          + "karpenter.sh/discovery"          = "eks-poc"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "eks-vpc-dev-private-us-east-1b"
          + "Type"                            = "private-subnet"
          + "environment"                     = "dev"
          + "karpenter.sh/discovery"          = "eks-poc"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                            = "eks-vpc-dev-private-us-east-1b"
          + "Type"                            = "private-subnet"
          + "environment"                     = "dev"
          + "karpenter.sh/discovery"          = "eks-poc"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "eks-vpc-dev-public-us-east-1a"
          + "Type"                   = "public-subnets"
          + "environment"            = "dev"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                   = "eks-vpc-dev-public-us-east-1a"
          + "Type"                   = "public-subnets"
          + "environment"            = "dev"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.112.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "eks-vpc-dev-public-us-east-1b"
          + "Type"                   = "public-subnets"
          + "environment"            = "dev"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                   = "eks-vpc-dev-public-us-east-1b"
          + "Type"                   = "public-subnets"
          + "environment"            = "dev"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "eks-vpc-dev"
          + "environment" = "dev"
        }
      + tags_all                             = {
          + "Name"        = "eks-vpc-dev"
          + "environment" = "dev"
        }
    }

Plan: 54 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_iam_openid_connect_provider_arn = (known after apply)
  + cluster_arn                         = (known after apply)
  + cluster_certificate_authority_data  = (known after apply)
  + cluster_endpoint                    = (known after apply)
  + cluster_iam_role_arn                = (known after apply)
  + cluster_iam_role_name               = "eks-cluster-role"
  + cluster_id                          = (known after apply)
  + cluster_oidc_issuer_url             = (known after apply)
  + cluster_primary_security_group_id   = (known after apply)
  + cluster_version                     = "1.28"
  + eks_secondary_admin_user            = "eksadmin1"
  + node_group_private_arn              = (known after apply)
  + node_group_private_id               = (known after apply)
  + node_group_private_status           = (known after apply)
  + node_group_private_version          = "1.28"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @yemisprojects, Action: `pull_request`*